public/build/stt-craig.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-28 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Speech To Text - Craig</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../resources/theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../resources/theme/css/readtheorg.css"/>
<link rel="shortcut icon" href="../resources/theme/favicon.ico">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Speech To Text - Craig
<br />
<span class="subtitle">Collecting data from The Late Late Show with Craig Ferguson</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction-and-expectations">1. Introduction and Expectations</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction-and-expectations" class="outline-2">
<h2 id="introduction-and-expectations"><span class="section-number-2">1.</span> Introduction and Expectations</h2>
<div class="outline-text-2" id="text-introduction-and-expectations">
<p>
In this project we will use <code>whisper</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, then new speech to text A.I. model, for transcribing unscripted dialog from The Late Late Show TV program. We will document and log the entire process for future visit. The outcome will be a SPA for data visualization using Plotly, React, Bootstrap and a Flask back-end with a PostreSQL database.
</p>

<p>
The data analysis will be performed in Python using a mix of scripts and Jupyter notebooks. The analysis may require addition of other A.I. submodules like <code>resemblyze</code><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> in order to distinguish speakers in a conversation or any other solutions that arise to any given problems.
</p>

<p>
The process will be iterative over a few collections of videos:
</p>

<ol class="org-ol">
<li>Extract audio from the collection (a TV season or a shorter period of time).</li>
<li>Source separation on music and speech.</li>
<li>Speaker separation to identify at least Craig Ferguson and non-Craig Ferguson speakers.</li>
<li>Audio data cleaning, stats and features.</li>
<li>Processing with <code>whisper</code>.</li>
<li>Text data cleaning and loading into a SQL database.</li>
<li>Data Analysis, find answers for word frequency, changes over time, or any other analytics questions.</li>
<li>Documentation and outcome presentation and thoughts for the iteration.</li>
</ol>

<p>
Once the process is done a few times, the whole collection of collections may be processed under the most successful parameters or they may be kept as separate processes. Then a single page web application will be created for presenting the results, which will include the analysed data in a production database.
</p>

<p>
Once the SPA is completed, it will be uploaded to a PVM or container in AWS or any other cloud provider. Then the page will be shared to the public.
</p>

<p>
Disclaimer: None of the data or results from the analysis will be used for monetary gains as I do not own the copyright to the original material. It is purely for educational purposes and I will absorb all cloud services expenses without asking for donations for this specific project.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/openai/whisper">https://github.com/openai/whisper</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://github.com/resemble-ai/Resemblyzer">https://github.com/resemble-ai/Resemblyzer</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Valdez</p>
<p class="date">Created: 2022-09-28 Wed 14:07</p>
</div>
</body>
</html>
